Revit 2027 API
Document.MassDisplayTemporaryOverride Property
 This setting controls temporary display in views of objects with mass category or subcategories.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MassDisplayTemporaryOverrideType MassDisplayTemporaryOverride { get; set; }
Public Property MassDisplayTemporaryOverride As MassDisplayTemporaryOverrideType
	Get
	Set
public:
property MassDisplayTemporaryOverrideType MassDisplayTemporaryOverride {
	MassDisplayTemporaryOverrideType get ();
	void set (MassDisplayTemporaryOverrideType value);
}
member MassDisplayTemporaryOverride : MassDisplayTemporaryOverrideType with get, set
Property Value
MassDisplayTemporaryOverrideType
 The MassDisplayTemporaryOverrideType that is active.
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The MassDisplayTemporaryOverrideType::Enum value is not in the proper range.
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Remarks
 This setting is temporary and is not stored in the document. The mass display overrides allow mass category and certain mass subcategories to be displayed in all views, regardless of the visibility settings of that view. The settings that show certain mass subcategories will also force the other mass subcategories to be hidden.
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace